#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`
#### Terraform Validation 🤖 `success`

<details><summary>Show Plan</summary>

```

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_s3_bucket_object.file7 will be destroyed
  - resource "aws_s3_bucket_object" "file7" {
      - acl                = "private" -> null
      - bucket             = "kjh-test-bucket-tagging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "d41d8cd98f00b204e9800998ecf8427e" -> null
      - force_destroy      = false -> null
      - id                 = "foldertest2/keep7" -> null
      - key                = "foldertest2/keep7" -> null
      - metadata           = {} -> null
      - source             = "/dev/null" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # aws_s3_bucket_object.file8 will be created
  + resource "aws_s3_bucket_object" "file8" {
      + acl                    = "private"
      + bucket                 = "kjh-test-bucket-tagging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "foldertest2/keep8"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/dev/null"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @kjhosein, Action: `pull_request`, Workflow: `GitHub Actions - testing`*